import type { Coordinates } from "@/types";

// 낮은 줌단계에서 (광역시/도 단위 클러스터링) 사용할 정보
export const REGION_CENTERS_LOW_ZOOM: Record<string, Coordinates> = {
  서울: { lat: 37.5665, lng: 126.978 }, // 서울시청
  경기: { lat: 37.2635, lng: 127.0286 }, // 수원시청
  인천: { lat: 37.4563, lng: 126.7052 }, // 인천시청
  부산: { lat: 35.1796, lng: 129.075 }, // 부산시청
  대구: { lat: 35.8714, lng: 128.6014 }, // 대구시청
  광주: { lat: 35.1602, lng: 126.8516 }, // 광주시청
  대전: { lat: 36.3504, lng: 127.3845 }, // 대전시청
  세종: { lat: 36.4919, lng: 127.2912 }, // 세종시청
  울산: { lat: 35.5392, lng: 129.3111 }, // 울산시청
  강원: { lat: 37.7519, lng: 128.876 }, // 강릉시청
  충북: { lat: 36.6372, lng: 127.4913 }, // 청주시청
  충남: { lat: 36.3504, lng: 127.3845 }, // 대전시청
  전북: { lat: 35.8242, lng: 127.148 }, // 전주시청
  전남: { lat: 34.8679, lng: 126.991 }, // 광주시청
  경북: { lat: 36.4919, lng: 128.8889 }, // 포항시청
  경남: { lat: 35.1796, lng: 128.1076 }, // 부산시청
  제주: { lat: 33.4996, lng: 126.5312 }, // 제주시청
};

// 서울 구 정보
const SEOUL_DISTRICTS: Record<string, Coordinates> = {
  "서울 강남구": { lat: 37.514575, lng: 127.0495556 },
  "서울 강동구": { lat: 37.52736667, lng: 127.1258639 },
  "서울 강북구": { lat: 37.63695556, lng: 127.0277194 },
  "서울 강서구": { lat: 37.54815556, lng: 126.851675 },
  "서울 관악구": { lat: 37.47538611, lng: 126.9538444 },
  "서울 광진구": { lat: 37.53573889, lng: 127.0845333 },
  "서울 구로구": { lat: 37.49265, lng: 126.8895972 },
  "서울 금천구": { lat: 37.44910833, lng: 126.9041972 },
  "서울 노원구": { lat: 37.65146111, lng: 127.0583889 },
  "서울 도봉구": { lat: 37.66583333, lng: 127.0495222 },
  "서울 동대문구": { lat: 37.571625, lng: 127.0421417 },
  "서울 동작구": { lat: 37.50965556, lng: 126.941575 },
  "서울 마포구": { lat: 37.56070556, lng: 126.9105306 },
  "서울 서대문구": { lat: 37.57636667, lng: 126.9388972 },
  "서울 서초구": { lat: 37.48078611, lng: 127.0348111 },
  "서울 성동구": { lat: 37.56061111, lng: 127.039 },
  "서울 성북구": { lat: 37.58638333, lng: 127.0203333 },
  "서울 송파구": { lat: 37.51175556, lng: 127.1079306 },
  "서울 양천구": { lat: 37.51423056, lng: 126.8687083 },
  "서울 영등포구": { lat: 37.52361111, lng: 126.8983417 },
  "서울 용산구": { lat: 37.53609444, lng: 126.9675222 },
  "서울 은평구": { lat: 37.59996944, lng: 126.9312417 },
  "서울 종로구": { lat: 37.57037778, lng: 126.9816417 },
  "서울 중구": { lat: 37.56100278, lng: 126.9996417 },
  "서울 중랑구": { lat: 37.60380556, lng: 127.0947778 },
};

// 경기도 시/군 정보
const GYEONGGI_DISTRICTS: Record<string, Coordinates> = {
  "경기 가평군": { lat: 37.82883056, lng: 127.5117778 },
  "경기 강화군": { lat: 37.74385833, lng: 126.49 },
  "경기 고양시": { lat: 37.65590833, lng: 126.7770556 },
  "경기 과천시": { lat: 37.42637222, lng: 126.9898 },
  "경기 광명시": { lat: 37.47575, lng: 126.8667083 },
  "경기 광주시": { lat: 37.41450556, lng: 127.2577861 },
  "경기 구리시": { lat: 37.591625, lng: 127.1318639 },
  "경기 군포시": { lat: 37.35865833, lng: 126.9375 },
  "경기 김포시": { lat: 37.61245833, lng: 126.7177778 },
  "경기 남양주시": { lat: 37.63317778, lng: 127.2186333 },
  "경기 동두천시": { lat: 37.90091667, lng: 127.0626528 },
  "경기 부천시": { lat: 37.5035917, lng: 126.766 },
  "경기 성남시": { lat: 37.44749167, lng: 127.1477194 },
  "경기 수원시": { lat: 37.30101111, lng: 127.0122222 },
  "경기 시흥시": { lat: 37.37731944, lng: 126.8050778 },
  "경기 안산시": { lat: 37.29851944, lng: 126.8468194 },
  "경기 안성시": { lat: 37.005175, lng: 127.2818444 },
  "경기 안양시": { lat: 37.3897, lng: 126.9533556 },
  "경기 양주시": { lat: 37.78245, lng: 127.0478194 },
  "경기 양평군": { lat: 37.48893611, lng: 127.4898861 },
  "경기 여주군": { lat: 37.324606, lng: 127.652958 },
  "경기 여주시": { lat: 37.29535833, lng: 127.6396222 },
  "경기 연천군": { lat: 38.09336389, lng: 127.0770667 },
  "경기 오산시": { lat: 37.14691389, lng: 127.0796417 },
  "경기 옹진군": { lat: 37.443725, lng: 126.6388889 },
  "경기 용인시": { lat: 37.23147778, lng: 127.2038444 },
  "경기 의왕시": { lat: 37.34195, lng: 126.9703889 },
  "경기 의정부시": { lat: 37.73528889, lng: 127.0358417 },
  "경기 이천시": { lat: 37.27543611, lng: 127.4432194 },
  "경기 파주시": { lat: 37.75708333, lng: 126.7819528 },
  "경기 평택시": { lat: 36.98943889, lng: 127.1146556 },
  "경기 포천시": { lat: 37.89215556, lng: 127.2024194 },
  "경기 하남시": { lat: 37.53649722, lng: 127.217 },
  "경기 화성시": { lat: 37.19681667, lng: 126.8335306 },
};

// 인천시 구/군 정보
const INCHEON_DISTRICTS: Record<string, Coordinates> = {
  "인천 강화군": { lat: 37.74692907, lng: 126.4878417 },
  "인천 계양구": { lat: 37.53770728, lng: 126.737744 },
  "인천 남구": { lat: 37.46369169, lng: 126.6502972 },
  "인천 남동구": { lat: 37.44971062, lng: 126.7309669 },
  "인천 동구": { lat: 37.47401607, lng: 126.6432441 },
  "인천 미추홀구": { lat: 37.46369169, lng: 126.6502972 },
  "인천 부평구": { lat: 37.50784204, lng: 126.7219068 },
  "인천 서구": { lat: 37.54546372, lng: 126.6759616 },
  "인천 연수구": { lat: 37.41038125, lng: 126.6782658 },
  "인천 중구": { lat: 37.4738484, lng: 126.6217617 },
};

// 중간 줌 레벨에서 사용할 지역 정보 생성
export const REGION_CENTERS_MID_ZOOM: Record<string, Coordinates> = {
  ...SEOUL_DISTRICTS,
  ...GYEONGGI_DISTRICTS,
  ...INCHEON_DISTRICTS,
  ...Object.fromEntries(
    Object.entries(REGION_CENTERS_LOW_ZOOM)
      .filter(([key]) => key !== "서울" && key !== "경기" && key !== "인천")
      .map(([key, value]) => [key, value]),
  ),
};
